# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [2]:
url = "https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv(url)
baby_names

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
afterdrop = baby_names.drop(columns=['Unnamed: 0','Id'],inplace=True)

### Step 6. Is there more male or female names in the dataset?

In [6]:
malecount = baby_names[baby_names['Gender'] == 'M'].value_counts().count()
print("The number of male in data is ",malecount)
femalecount = baby_names[baby_names['Gender'] == 'F'].value_counts().count()
print("The number of male in data is ",femalecount)
if malecount > femalecount:
    print("M is More than F")
else:
    print("F is More than M")

The number of male in data is  457549
The number of male in data is  558846
F is More than M

In [7]:
MisMoreF = baby_names['Gender'].value_counts()
print(MisMoreF)
MisMoreF.idxmax()

F    558846
M    457549
Name: Gender, dtype: int64

'F'

### Step 7. Group the dataset by name and assign to names

In [19]:
names = baby_names.groupby('Name')
names

### Step 8. How many different names exist in the dataset?

In [9]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [10]:
names['Count'].sum().idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [11]:
names['Count'].sum().value_counts().min()

1

### Step 11. What is the median name occurrence?

In [12]:
baby_names['Count'].median()

11.0

In [13]:
baby_names[baby_names.Count == baby_names.Count.median()]

                Name  Year Gender State  Count
71           Makayla  2004      F    AK     11
72             Maria  2004      F    AK     11
73              Mary  2004      F    AK     11
74          Michelle  2004      F    AK     11
259        Alexandra  2005      F    AK     11
...              ...   ...    ...   ...    ...
1016276  Christopher  2014      M    WY     11
1016277       Corbin  2014      M    WY     11
1016278        Gavin  2014      M    WY     11
1016279      Greyson  2014      M    WY     11
1016280       Isaiah  2014      M    WY     11

[36199 rows x 5 columns]

### Step 12. What is the standard deviation of names?

In [14]:
names['Count'].sum().std()

11006.06946789057

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [17]:
names['Count'].sum().describe().to_frame()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000